{"data":{"allResources":{"nodes":[{"description":"10 things great salespeople do","href":"https://www.reddit.com/r/Entrepreneur/comments/btyuco/10_things_great_salespeople_do/","time":"Tuesday, May 28th 2019","fields":{"tags":["business-development","sales"],"domain":"reddit.com","contentTxt":"<div theme=\"[object Object]\" class=\"_292iotee39Lmt0MkQZ2hPV RichTextJSON-root\"><p>1. Have a sales process</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">You should have a sales process in place so you can measure and repeat the steps that work, and weed out ones that don’t. If you’re going in without a plan you’ll never truly know what works and what doesn’t, you won’t be able to test changes.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Think about a website, if you changed something on it you’d want to test whether that change improved or worsened your metrics, it’s no different with sales. You are constantly trying to get better through testing a variable to see if it can improve your hit rate. That’s why you need a sales process, a formalised set of steps you usually take.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">The scientific method boiled down is simply that, testing a hypothesis and look how it has revolutionised the world. The world of sales is not mystical it exists in the material world and through testing you will find the patterns that’ll help you improve your KPIs.</p><p>2. Review your pipeline</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">You’ve got to keep reviewing your pipeline so you ensure that you have a constant stream of deals coming down. That way you’ll know ahead of time if there’s a lean period coming and so that you can keep pushing your deals through each stage of the pipeline. This helps you plan for the future and is crucial to making sure you hit targets.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">With a pipeline you can see what the average deal is worth at each stage and you can see how big each potential deal is. Therefore you can see if the value of our average deal over time might go down, or if a deal is particularly lucrative and whether its been sitting at a particular stage for a while - what do I need to do to push it forwards or is it a bust and I should focus on another?</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Pipelines are a useful framework to use, if you’re not thinking in those terms start doing so because it’ll help you decide where to focus your energies.</p><p>3. Be a knowledgebase for your product</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Try talking about a subject you know little to nothing about, there’ll be long awkward pauses as you frantically think of something to say. You won’t inspire much confidence and you’ll lose whoever you’re speaking to.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">You need to know what your product is, the benefits and how it fits into the market as well as some of its drawbacks and how to counter or obviate them. If you can do that, then you’ll be much more persuasive and it’ll help you develop the script for the sale. Plus human beings aren’t robots they ask questions, you can’t predict every question that’ll ever be asked but if you have some depth of knowledge you can create an answer.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Part of being a great salesperson is being perceived as competent which breeds trust. If you come across as a bs artist who is trying to finesse the prospect you lose that trust and you lose the sale. So do your homework.</p><p>4. Research your prospects thoroughly</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">In a similar vein to knowing your product, know who you’re selling to. It may seem trivial but we see these schoolboy errors again and again.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Whenever we get a cold call and we get the question ‘can I speak with someone who deals with your marketing?’ Our immediate reaction is spam.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">There are a ton of resources like Linkedin where you can look up the person you need to talk to in an organisation, it’ll help you get past the gatekeeper and make the case for what you’re selling.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">What if the prospect runs a business similar to another one of your existing customers? That’s a great case study to use as social proof but if you don’t put in the work ahead of time you won’t know that, and so you’ve unnecessarily tied one hand behind your back. If you’re interested and you should be, check out our beginners guide to cold calling a prospect <a href=\"https://realtimecrm.co.uk/posts/a-beginners-guide-to-cold-calling-a-prospect/\" class=\"_3t5uN8xUmg0TOwRCOGQEcU\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>.</p><p>5. Frame your product or service as the solution to your problems</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">So your product is amazing, it has all these benefits. Who cares? Generic benefits that have no relevance to me are of no interest to me. You have to make the prospect care.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">How do you do that? By asking questions and finding the problems they have and matching those problems to the solutions provided by your product or service. In the mind of the prospect you’ve got to make them feel like their hand is cold and you’re offering them some gloves. You’ve got to be subtle about how you do this, you don’t want to force the conversation but lead them in this direction and then make them feel like they came to the decision of ‘yeah this product might just solve my problem(s)‘.</p><p>6. Become a better speaker</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">People are quite shallow. Taller men tend to do better at job interviews, same thing with better looking people.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">You can improve those a little by dressing better and trying to stay fit but you can become more charismatic and therefore more persuasive. The most famous example of this is Warren Buffet who had horrible crippling stage fright but in his early days recognised the weakness and took classes on public speaking, today he holds court every year at the Berkshire Hathaway annual meeting in front of thousands who listen intently to his every word. He rates that speaking course higher than his degree in helping him to get to where he has. He had to persuade those first people to invest in Berkshire. He had to persuade Senators at the hearings of the Solomon Brothers not to destroy the company by removing its trading licence after their illegal actions were caught. Just listen to Warren speak and how he uses words to convey contrition, anger and righteousness. In the end he succeeded, if was not a great speaker he would not have done so.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\"><a href=\"https://youtu.be/7u7-UNSkr4o\" class=\"_3t5uN8xUmg0TOwRCOGQEcU\" rel=\"noopener noreferrer\" target=\"_blank\">https://youtu.be/7u7-UNSkr4o</a></p><p>7. Ask for referrals</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">If you spoke to one new person a day, in a year you would speak to 365 new people. That’s a lot of people. That’s 365 potential sales opportunities.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">You’ve got to be able to build and grow your network so don’t be afraid to ask for introductions from your existing network to widen it. But when asking be specific about what you want when it comes to getting the introduction. You want to make it as simple as possible for your existing customer, a friend in another industry or whoever it is to help you get to that new person.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Fish in a pond only grow so big, in the oceans they grow really really big. You should always work to grow your network. If you’ve got the greatest sales pitch in the history of man that has an amazing conversion rate then the only limiting factor is the number of people you pitch to. The obvious thing you want to do is increase the number of people you pitch to. It’s not rocket science.</p><p>8. Build personal relationships</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Quantity is important but so is quality. You don’t just want a vast sea but a deep ocean. Being able to build deeper connections with people and get to know them is useful because they’ll then be more willing to help you. That’s a function of likability.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">You might not be the most charming person in the world but you don’t have to be. A lot of it is being a good listener and conversationalist, find a common interest with people and develop conversations around it. Don’t just be all cold sales, have in jokes. Make it not seem like work, if it seems like work they’ll be very shallow connections that will have a limited shelf life.</p><p>9. Be passionate</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">If you’re a Debbie Downer you will suck the air out of a room and people will want to get away from you. They certainly won’t want to listen to you.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">If you have no passion for what you’re selling they’ll make assumptions like this company must be awful, this product must be terrible. You have to elicit a strong emotion to get people to do what you want, in the case of making a sale you’ve got to get them excited and the best way to do that is to be excited about what you’re selling too.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">You’ve got to create a sense of FOMO, fear of missing out. There’s been studies that show when a person sees another person yawn they’re more likely to yawn. So you’ve got to set the right tone.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">The lack of passion may have a simple cause and so a simple fix, for example if you’re not getting enough sleep at night you’re going to be drained and just not physically capable of creating that enthusiasm, diet and exercise are important too.</p><p>10. Don’t be afraid to walk away</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">Sometimes you’re just not the right fit and you’re wasting time you’ll never get back trying to get blood out of a stone. You’d be much better off spending that time on greener pastures.</p><p class=\"_1qeIAgB0cPwnLhDF9XSiJM\">This will come with experience but time is money and don’t waste it. We’ve had potential prospects lead us on a merry go round and never making a decision, it’s frustrating and it’ll hurt your motivation and harm other more probable deals that are allowed to wither as they lack the sunlight of your attention.</p></div>"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"10-things-great-salespeople-do"}}