{"data":{"allResources":{"nodes":[{"description":"I Sell Onions on the Internet","href":"https://www.deepsouthventures.com/i-sell-onions-on-the-internet/","time":"Tuesday, April 23rd 2019","fields":{"tags":["entrepreneur","startup","startup-stories"],"domain":"deepsouthventures.com","contentTxt":"<div class=\"entry-content\" itemprop=\"text\"><p><a href=\"https://www.deepsouthventures.com/wp-content/uploads/vidalia-onions-in-field.jpg\"><img src=\"https://www.deepsouthventures.com/wp-content/uploads/vidalia-onions-in-field-300x225.jpg\" alt=\"Vidalia Onions in the field\" width=\"300\" height=\"225\" class=\"alignright size-medium wp-image-186\" srcset=\"https://www.deepsouthventures.com/wp-content/uploads/vidalia-onions-in-field-300x225.jpg 300w, https://www.deepsouthventures.com/wp-content/uploads/vidalia-onions-in-field-1024x768.jpg 1024w, https://www.deepsouthventures.com/wp-content/uploads/vidalia-onions-in-field.jpg 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\"></a>Vidalia Onions to be exact. </p><span>\n</span><p>They’re classified as a sweet onion, and because of their mild flavor (they don’t make your eyes tear up), some folks can eat them like an apple. Most of my customers do.</p><span>\n</span><p>During a phone order one season – 2018 I believe – a customer shared this story where he smuggled some Vidalias onto his vacation cruise ship, and during each meal, would instruct the server to ‘<em>take this onion to the back, chop it up, and add it onto my salad</em> ‘. That story made me smile.</p><span>\n</span><p>Folks who love Vidalias, <em>love Vidalias</em>.</p><span>\n</span><p>Let me stop, though. I don’t want to get ahead of myself.</p><span>\n</span><p>How did all this start? I’m a web guy. I’m not a farmer.</p><span>\n</span><hr><span>\n</span><h2>I’M ADDICTED TO DOMAIN NAMES</h2><span>\n</span><p>Oddly enough, it <u>didn’t</u> start with an idea.</p><span>\n</span><p>Back in  2014, the domain name <a href=\"https://www.vidaliaonions.com/\" target=\"_blank\" rel=\"noopener noreferrer\">VidaliaOnions.com</a> expired, and went up for auction. For some reason the original owner abandoned it, and being a GA native, I recognized it ’cause I was familiar with the industry. I’ve <a href=\"https://www.deepsouthventures.com/build-a-side-business/\" target=\"_blank\" rel=\"noopener noreferrer\">been buying expired or abandoned domain names</a> for a while, and enjoy developing them into niche businesses. This one was different though – I backordered the domain as a spectator, but for kicks &amp; giggles, I dropped in a bid around $2,200 ’cause I was confident I’d be outbid. </p><span>\n</span><p>5 minutes later, I was the proud owner of VidaliaOnions.com. I had no idea what to do with it. Ready, fire, aim.</p><span>\n</span><p>After the domain landed in my account, I attempted to re-focus my attention on other projects, but the name kept clawing me. Like it was saying:</p><span>\n</span><blockquote><p>… yoo-hoo… over here… 😘</p></blockquote><span>\n</span><hr><span>\n</span><p><img src=\"https://www.deepsouthventures.com/wp-content/uploads/william-faulkner-bench-480.jpg\" alt=\"William faulkner statue on bench\" width=\"480\" height=\"358\" class=\"aligncenter size-full wp-image-189\" srcset=\"https://www.deepsouthventures.com/wp-content/uploads/william-faulkner-bench-480.jpg 480w, https://www.deepsouthventures.com/wp-content/uploads/william-faulkner-bench-480-300x224.jpg 300w\" sizes=\"(max-width: 480px) 100vw, 480px\"></p><span>\n</span><p>William Faulkner had an interesting perspective on writing his characters – on how <em>they essentially wrote themselves</em>, and how <em>he</em> (Faulkner) served as a sortof mechanical in-between. His quote:</p><span>\n</span><blockquote><p><em>“I would say to get the character in your mind. Once he is in your mind, and he is right, and he’s true, then he does the work himself. All you need to do then is to trot along behind him and put down what he does and what he says… You’ve got to know the character. You’ve got to believe in him. You’ve got to feel that he is alive… After that, the business of putting him down on paper is mechanical.” <a href=\"http://faulkner.lib.virginia.edu/display/wfaudio21\" target=\"_blank\" rel=\"noopener noreferrer\">[source]</a></em></p></blockquote><span>\n</span><p>The way Faulkner treats his characters, I treat domain name projects. I buy them with an intention to develop. And I let <u>them</u> take the lead. They’re the inspiration for the business itself. They guide me towards what they need to become. I’m just the dude behind the keyboard (sorta).</p><span>\n</span><p>Sometimes I buy them at auction, sometimes I buy them from original-owners. But universally, the domain name always comes first, the business idea comes second. </p><span>\n</span><p>I don’t usually rush into development. The path of some domains is apparent before I acquire. Others, the path reveals itself down the road. Vidalia was the latter. And after I acquired it, it kept nudging me.</p><span>\n</span><blockquote><p>Build me… build me… you know how. And you <em>know</em> what I should be…</p></blockquote><span>\n</span><p>After a month, I began to understand what it was telling me. That I buy pears from Harry &amp; David every year, and I should mimic that same service for Vidalia Onions. Instead of farm-to-door pears, farm-to-door Vidalia Onions. </p><span>\n</span><p>An interesting idea, but daunting to approach. I’m not a farmer, I don’t have employees, I don’t have a packing shed. And I have no logistics or distribution system setup.</p><span>\n</span><p>But the domain name kept staring at me. ಠ~ಠ ////<em>whispering</em>////</p><span>\n</span><blockquote><p>Just start..</p></blockquote><span>\n</span><hr><span>\n</span><h2>“take the path to Nothing, and go Nowhere until you reach it.”</h2><em>-the tao of pooh</em><span>\n</span><span>\n</span><p>And so I did. I’m just dumb enough to try a project of this complexity. The market size justified an online venture. Google Trends showed strong search volume for the phrase. And chefs around the world had already belted their praise over the ‘caviar of sweet onions’. </p><span>\n</span><p>So I just started down a path, with no end goal or milestone set. I just started going. No angel investor. No VC backer. I just used some modest profit from my other <a href=\"https://www.deepsouthventures.com/\" target=\"_blank\" rel=\"noopener noreferrer\">domain name developments</a> to fund the endeavor. This was Feb of 2015.</p><span>\n</span><p>Once I began, I discovered there was a Vidalia Onion committee which represents all the Vidalia farmers. So I reached out to them.</p><span>\n</span><p>They were kind enough to listen to me.</p><span>\n</span><p>They introduced me to 3 farmers in the Vidalia region.</p><span>\n</span><p>I got along quite well with the 3rd farmer I met (Aries Haygood), so we decided to partner &amp; give this a shot. His farm had been around for 25 years; they hadn’t focused on direct-to-consumer; but they understood its value. They operated a packing shed as well. And most importantly, they grew an award winning Vidalia. </p><span>\n</span><p>And so we went.  </p><span>\n</span><p>We conservatively estimated fifty (50) orders for our 2015 season. We ended up with over six hundred (600). </p><span>\n</span><p>While the farm concentrated on the Vidalia, I concentrated on customer service, marketing, branding, web development, &amp; logistics. I didn’t have other projects that were this front-facing, customer wise. And I discovered I immensely enjoyed it.</p><span>\n</span><p>The more we both focused on these efforts, the more we grew. So much so, that other Vidalia operations began shutting down their mail order efforts and simply directed folks our way.</p><span>\n</span><p>We began testing alternate marketing avenues – a billboard on I-95 just south of Savannah, GA facing northbound traffic; sponsoring a bike rider headed cross country for charity; sponsoring a high school basketball team, as well as a grade school auction fundraiser. </p><span>\n</span><p>We added a phone order hotline, which – from time to time – generates more sales than online.</p><span>\n</span><p>We also made a few colossal mistakes, which were entirely of my doing, like blowing $10,000 on faulty shipping boxes from an ill-informed &amp; misleading box manufacturer in Dalton, GA. (it happened early in our journey, and nearly forced me to shut down)</p><span>\n</span><p>Ultimately, I refused to let something like that kill this. Honestly, my customers would be quite upset if we disappeared. Last season, while I called a gentleman back regarding a phone order, his wife answered. While I introduced myself, she interrupted me mid-sentence and hollered in exaltation to her husband: ” THE VIDALIA MAN! THE VIDALIA MAN! PICK UP THE PHONE! ”</p><span>\n</span><p>At that moment, I realized we were doing something right. Something helpful. Something that was making a positive impact.</p><span>\n</span><p>I sometimes say I prefer projects that focus on purpose over profit. And as we enter our 5th season, this one continues to do just that.</p><span>\n</span><p>And it’s immensely gratifying. I feel so fortunate to be associated with this industry.</p><span>\n</span><p>I’m Peter Askew, and I sell onions on the internet.</p><span>\n</span><noscript><img src=\"https://www.deepsouthventures.com/wp-content/uploads/vidalia-onions-in-field.jpg\" alt=\"Vidalia Onions in the field\" /><img src=\"https://www.deepsouthventures.com/wp-content/uploads/vidalia-onions-in-crate.jpeg\" alt=\"Vidalia Onions in a wooden crate\" /><img src=\"https://www.deepsouthventures.com/wp-content/uploads/vidalia-onion-shipping-boxes.jpg\" alt=\"Vidalia Onions boxed up for home delivery\" /></noscript><span>\n</span><span>\n</span><span>\n</span><hr><span>\n</span><p>** below – from the field during harvest – these have been dug &amp; are ready for clipping<br>( click &amp; drag )</p><span>\n</span><span>\n</span></div>"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"i-sell-onions-on-the-internet"}}