{"data":{"allResources":{"nodes":[{"description":"Finding my next bootstrapped business idea","href":"https://www.derrickreimer.com/essays/2019/05/28/finding-my-next-bootstrapped-business-idea.html","time":"Wednesday, May 29th 2019","fields":{"tags":["business-development","startup"],"domain":"derrickreimer.com","contentTxt":"<div class=\"markdown\" itemprop=\"articleBody\"><span>\n    </span><p>Most business ideas are neither objectively good nor bad. The quality of an idea for you (as a founder) depends on your goals, your skill set, and your risk tolerance.</p><span>\n\n</span><p>Even the quintessential lousy idea of trying to “build the next Facebook” is not necessarily a <em>bad</em> idea. Someone will eventually pull it off – it just comes with an enormous amount of risk and requires one hell of a skill set.</p><span>\n\n</span><p>So given a list of potential ideas, how should one go about picking The One?</p><span>\n\n</span><p>It turns out humans are pretty bad at comparing things. If idea X will take three months to build and has a large addressable market, is it better or worse than idea Y that will take one month to make but has a slightly smaller market? Who’s to say? It gets even trickier the more variables you consider.</p><span>\n\n</span><p>There’s a better way that I first heard articulated by Jason Cohen: instead of trying to rank your ideas, run them through a set of filters to eliminate those that don’t fit.</p><span>\n\n</span><h2 id=\"why-am-i-starting-a-company\">Why am I starting a company?</h2><span>\n\n</span><p>Before trying to establish my filters, I need to understand why I’m doing this in the first place.</p><span>\n\n</span><p>Do I want to change the world by creating innovative new products? Do I aspire to make a life-changing sum of money and retire early? Am I just tired of working for someone else?</p><span>\n\n</span><p>My primary motivation is to earn a comfortable living for my family, with a bit left over to fund causes for which I have a passion. I want to achieve predictable product revenue that does not directly correlate with the number of hours I work.</p><span>\n\n</span><p>I want the freedom to build products that are interesting to me as a maker. I love to strategize, design, and create. I don’t enjoy managing people. Eventually, I want the ability to take a month off of work without negatively impacting the business.</p><span>\n\n</span><h2 id=\"what-are-my-growth-ambitions\">What are my growth ambitions?</h2><span>\n\n</span><p>It’s glamorous to imagine coming up with a bold idea, wooing investors, and hiring best-in-class people to execute on the vision. And yet, the venture capital track comes with a high degree of risk (most fail), a strong growth mandate (fast-paced, long hours), and people management.</p><span>\n\n</span><p>I know I’m not interested in trying to build the next unicorn. <a href=\"http://www.paulgraham.com/growth.html\">Paul Graham</a> wouldn’t even call what I want to do a “startup”:</p><span>\n\n</span><blockquote>\n  <p>A startup is a company designed to grow fast. Millions of companies are started every year in the US. Only a tiny fraction are startups. Most are service businesses — restaurants, barbershops, plumbers, and so on. These are not startups, except in a few unusual cases. A barbershop isn’t designed to grow fast. Whereas a search engine, for example, is.</p>\n</blockquote><span>\n\n</span><p>Like the barbershop owner, I want a small business – only I happen to be selling software products on the internet instead of haircuts on a neighborhood corner.</p><span>\n\n</span><h2 id=\"narrowing-down-my-options\">Narrowing down my options</h2><span>\n\n</span><p>Since I want to bootstrap my next venture, <strong>the market must already exist</strong>. There should be competitors attempting to serve the market (but perhaps not doing a great job of it).</p><span>\n\n</span><p>I’m relatively risk-averse, so an <strong>MVP must be shippable within a few months</strong>. It’s hard to know upfront if this is possible, but I can confidently eliminate ideas that I <em>know</em> will take a long time. The product must be valuable to a particular niche, even when it’s new.</p><span>\n\n</span><p><strong>The product should not be mission-critical.</strong> By mission-critical, I mean so vital that even a short period of downtime will have a significant impact on my customers’ businesses.</p><span>\n\n</span><p><strong>Making a sale shouldn’t require more than a few decision makers.</strong> A counter-example would be a product like Slack, which requires buy-in from every stakeholder in a company to adopt.</p><span>\n\n</span><p><strong>Native apps should not be a minimum requirement.</strong> These days, users have come to expect native desktop and mobile clients for specific categories of applications (communication, project management, and note-taking, to name a few). It’s hard enough building for one platform as a small operator, let alone three or four platforms.</p><span>\n\n</span><p>Since I regularly invest in growing my following on <a href=\"https://twitter.com/derrickreimer\">Twitter</a> and <a href=\"https://artofproductpodcast.com/\">my weekly podcast</a>, <strong>the market should overlap with my existing audience</strong>.</p><span>\n\n</span><h2 id=\"knowing-when-to-compromise\">Knowing when to compromise</h2><span>\n\n</span><p>My filters look like this right now:</p><span>\n\n</span><ul>\n  <li>The market must already exist</li>\n  <li>MVP must be shippable within a few months</li>\n  <li>The product should not be mission-critical</li>\n  <li>Making a sale shouldn’t require more than a few decision makers</li>\n  <li>Native apps should not be a minimum requirement</li>\n  <li>The market should overlap with my existing audience</li>\n</ul><span>\n\n</span><p>There is no perfect business idea, and I may have to compromise on some of these criteria – that’s okay. I expect these to evolve as I gain more clarity.</p><span>\n\n</span><p>I have a handful of filters that didn’t make it on the list (at least for now). Most of these have to do with avoiding the annoying things I’ve encountered in previous businesses.</p><span>\n\n</span><p>Dealing with email blacklists and spammers at Drip was exhausting. Trying not to get obliterated by Google at HitTail was frightening. One time I prototyped a lead generation tool based on the Twitter API, only to see the APIs get deprecated not long after.</p><span>\n\n</span><p>It’s tempting to keep a growing list of things I will never do again, but I’m trying to resist. It sounds counterintuitive, but I may even intentionally pursue a problem I’ve tackled in the past since I already know what to expect and how to get ahead of some of the challenges.</p><span>\n\n</span><p>No business exists in a vacuum. There will always be parts that keep you up at night – but hopefully not too often!</p><span>\n\n  </span></div>"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"finding-my-next-bootstrapped-business-idea"}}