{"data":{"allResources":{"nodes":[{"description":"Don't Waste Time On User Onboarding","href":"https://greaterdanorequalto.com/dont-waste-time-on-onboarding/","time":"Thursday, May 2nd 2019","fields":{"tags":["SaaS","product-design","startup","user-experience"],"domain":"greaterdanorequalto.com","contentTxt":"<div class=\"post-content\"><span>\n                    </span><p>There are oodles of articles about <a href=\"https://www.appcues.com/blog/user-onboarding-tools\">what tools to use for user onboarding</a>, <a href=\"https://speckyboy.com/onboarding-ui-css-javascript/\">what your user onboarding UI should looks like</a>, and <a href=\"https://tapptitude.com/blog/complete-guide-user-onboarding-framework/\">exactly how to craft the perfect user onboarding experience</a>. They're not <strong>bad </strong>advice, not <strong>exactly</strong>, but for a great many SaaS startups, they're a <strong>waste of valuable time</strong>.</p><p>There's no shortage of critically-important things screaming for your attention when you're running a startup, so time is always at a premium. &nbsp;It's important, then, to prioritize. &nbsp;Focus on things that make a big difference and make life easier later. &nbsp;But it's also important to make sure that you don't focus on things that make life <strong>harder</strong> later, and user onboarding can definitely be one of those things if you're not ready.</p><p>If you haven't hit product/market fit, haven't settled on your final UX, or aren't yet certain how your trial users are interacting with your service, adding an onboarding tour won't necessarily improve things. &nbsp;In fact, it <strong>could</strong> simply calcify your current, non-optimal choices and make them that much harder to change in the future!</p><p>One of your big advantages as a startup is agility - you can move faster than the big dogs can. &nbsp;You can improve, build features, and pivot in a way that they, with their larger, entrenched systems, simply can't. &nbsp;A heavy user onboarding flow can jeopardize that.</p><p>So if not that, then what?</p><p>If it's not yet time to be working on your user onboarding, what should you be working on? &nbsp;What critically-important tasks could be the next big thing to make a real difference to your business? &nbsp;Well, that list is potentially endless, but I can think of some top contenders.</p><h3 id=\"talk-to-your-customers\">Talk to your customers</h3><p>I'm sure you've done this by now, but you really ought to do it again. &nbsp;And again. &nbsp;And keep doing it. Your customers are your single-biggest source of actionable business advice you have, so make sure to take advantage of it. &nbsp;Everything else on this list is optional, depending on how far along your business is, but this is not.</p><p>Make sure you're at least talking to paying customers, since feedback from them is coming from the people who are actually willing to pay you money. &nbsp;Freemium users will tell you about changes that will make them happier freemium users. &nbsp;Trial, expired trial, and churned users are better, since they can tell you about what might have gotten them to pay or stay around. &nbsp;But make sure you're not ignoring your paying users, as they're your target market, <em>by definition</em>.</p><h3 id=\"see-what-your-first-run-experience-is-actually-like\">See what your first-run experience is actually like</h3><p>Before you add that multi-step, tooltip-driven, unskippable eyesore on top of your service, make sure to really see what it's already like for a first-run user. &nbsp;Grab objective friends, family, or randos from a hallway, or consider a service like <a href=\"https://www.usertesting.com/\">User Testing</a>, and watch what they do when they try to navigate your site. This is a great opportunity to fix problems in your usability <em>before</em> you start drawing blinking arrows on top of things.</p><p>If you have actual live people sit down to test your site, make sure you do the number-one most-important thing: <em>shut up</em>. &nbsp;Don't explain your choices or the difficulties you experienced that lead to your current design, don't give hints, and definitely don't say anything like \"Oh my god, it's right there, just click the giant flashing button!\" The smartest people miss the most obvious things, so your PHD friend will miss the flashing button in front of her, and you will miss the fact that while you've clicked that button a thousand times already, it's next to four other flashing buttons that make things very difficult for regular users.</p><p>Get people to narrate their thoughts. &nbsp;Take notes. &nbsp;Record if you can. &nbsp;Some things will become immediately obvious, while others may take a few repetitions for you to realize that they're real problems or opportunities for improvement.</p><p>And just a small thing - if you do take recordings, keep them around. &nbsp;They may not be obviously useful once you've fixed all the issues they helped you find, but if you find great success and want to look back in ten years, you'll be glad to have them.</p><h3 id=\"simplify-your-first-run-experience\">Simplify your first-run experience</h3><p>Okay, so your service is immensely easier to navigate since you ran it past a battery of theoretical users. &nbsp;Now cut half of it out.</p><p>For real, when you drop someone right in the middle of a full user interface with all the bells and whistles present and accounted for, <a href=\"https://en.wikipedia.org/wiki/Analysis_paralysis\">analysis paralysis</a> sets in. Cut down on all the extra things that aren't important in the moment, and focus on making sure the path to the next most-important task is clear.</p><p>Sprint to value. &nbsp;You want to drive your users towards the thing that makes them go \"Ohhhh, coooool, <em>that's</em> what this does! &nbsp;I want to whip out my credit card right now!\" &nbsp;Don't waste valuable time getting them to upload a logo and customize the colour of their profile page when your service is focused around offering the world's best gamification API. &nbsp;Have them set up a badge system and send their first badge-awarding events ASAP!</p><h3 id=\"add-sample-data-to-avoid-an-empty-nest\">Add sample data to avoid an empty nest</h3><p>A fresh notebook can be exciting, but it can also be daunting. &nbsp;How much easier is it to write an article when it has some structure roughed-in already? &nbsp;How much easier is it to draw a portrait when you have a reference handy? &nbsp;How much easier is it to understand a complex formula when there's sample data available?</p><p>A lot. &nbsp;So make sure you don't leave your users with a discouragingly empty page.</p><p>If a user doesn't have any data available, show an example of what it might look like after some regular use. &nbsp;This is also an opportunity to show off a bit of the character of your company, so your sample data can be funny, aspirational, deadly serious, whatever is most appropriate.</p><p>This is also an opportunity to race to value, if your service relies on more complex setup or interactions to prove itself. &nbsp;Instead of collecting data for a month and doing regular analysis against it to prove value, display some demo data that shows what that would look like. &nbsp;Or add a collection of conversations that demonstrate how differently users will converse on <em>your</em> Slack competitor and how much more-productive that will make them.</p><h3 id=\"consider-offering-concierge-setup\">Consider offering concierge setup</h3><p>Paul Graham has <a href=\"http://paulgraham.com/ds.html\">an excellent essay about the power of doing things that don't scale</a>. &nbsp;From personalized, real-human customer service to founders making the actual cold calls and sales directly, involving yourself in the early-stage big-return non-scaling things actually has outsized rewards from what you may expect.</p><p>\"Concierge setup\" is one of those non-scaling things that can make a huge difference. &nbsp;Instead of putting together a tailored automated onboarding experience, book a time slot where you will personally call or video chat with your customer and walk them through the setup process. &nbsp;If you have a complex onboarding process (integrating APIs, installing libraries, etc.) or are simply very early-stage, you can learn a whole lot about what users are finding difficult or confusing about your service from these calls.</p><p>Your users also get an opportunity to interact with you one-on-one in a way they'd never get to with your larger competitors. &nbsp;People like people, and if you can put a friendly, smiling, helpful face on your company, they'll probably like your service a lot more, because they want to see <strong>you specifically</strong> succeed.</p><h3 id=\"shorten-your-trial\">Shorten your trial</h3><p>Think about the last time you had a project with a due date far in the future. &nbsp;How much pressure did you feel to get started on it right away? &nbsp;Very little, right! &nbsp;It's the same thing for your trial. &nbsp;If you offer a very long trial period, there's no \"pressure\" to actually evaluate the service, which can easily lead to people plain <strong>forgetting</strong> about you until the last couple days, at which point some people will ask for an extension, but others will simply not even bother trialing at all!</p><p>Provide a short-enough trial to properly evaluate the features you provide, <strong>and no longer</strong>. &nbsp;Two weeks is great, though a week is even better. &nbsp;You want people to prioritize trying your service, and not feel like they can put it off until later.</p><p>But what about if you have a service that <strong>requires</strong> a longer period of time to see benefits from (machine learning analysis of site shopping patterns, maybe), or what about if you want to <strong>really</strong> get aggressive? &nbsp;Consider <strong>getting rid of your free trial entirely</strong>. &nbsp;Instead, offer a money-back guarantee. &nbsp;This has two big benefits: </p><ol><li>This is the best way to get people to prioritize evaluating your service. &nbsp;If they don't evaluate your service before a trial ends, they lose an opportunity. &nbsp;If they don't evaluate your service before a money-back guarantee period ends, they lose <strong>money</strong>. &nbsp;Nobody wants to lose money, not like that.</li><li>There's a fairly well-known psychological phenomenon called the <a href=\"https://www.psychologytoday.com/us/blog/science-choice/201506/how-the-ownership-something-increases-our-valuations\">endowment effect</a>, that states that owning something increases its value in its owner's eyes. When people directly buy your service with a money-back guarantee, they are more likely to evaluate your service positively, because otherwise, why would they have spent money on it? &nbsp;They own it, so of course they like it!</li></ol><p>Of course, some people will still make mistakes and only notice rebills well after they've happened, and long after they've forgotten about the money-back guarantee period. &nbsp;Unless you incur significant expenses from providing service, I'd recommend nearly always providing money-back returns even past the guarantee period if a user forgets about your service and doesn't evaluate it properly. &nbsp;The goodwill is nearly always more valuable than the few months' income.</p><h3 id=\"ensure-your-pricing-is-perfect\">Ensure your pricing is perfect</h3><p>When it comes time to pull that trigger, you don't want to introduce a last-minute objection - make sure your pricing tiers are clear, consistent, and compelling. &nbsp;The last thing you want is to lose a sale at this point because your potential customer is too confused to figure out the right plan for them.</p><p>First, decide how your pricing is going to be differentiated (flat, user-based, feature-based, usage-based, commission-based, etc.), and make sure the differences between your tiers clearly indicate the price advantages along this axis. &nbsp;If your plans change along multiple axes, consider simplifying, or at least making sure that everything remains simple to understand.</p><p>If you're selling B2B, make sure you have a \"Business\" tier. &nbsp;It doesn't have to be called exactly that, but at least one of your mid-tier plans should clearly identify itself as the plan for serious businesses. Many businesses will select it by default over a lower-priced plan targeted at agencies, solopreneurs, and pro-ams. &nbsp;Consider, if you run a respectable $10m ARR SaaS business, are you going to pick the plan called \"Starter\" or the plan called \"Business\", even if \"Starter\" has everything you need for now? &nbsp;You're clearly not a \"starter\" and what if you need room to grow? &nbsp;Better pick \"Business\" just to be sure.</p><p>This also gives you a very valuable additional and understandable axis to differentiate your plans on - support. &nbsp;Lest you think I'm just trying to take advantage of psychological tricks in the previous paragraph, businesses tend to have different ideas on the level of support appropriate to a service than solo bootstrappers, and this gives you an opportunity to include an appropriate service-level guarantee in an appropriately-priced plan.</p><p>Which isn't to say that you can dilly-dally on support requests for your Bronze plans (though by now you should understand that calling it a \"Bronze\" plan is a bad idea - it doesn't provide the appropriate context to help potential customers decide). &nbsp;You want to respond to all your customer support requests as quickly as you can. &nbsp;But providing higher guarantees for those higher plans helps overcome objections, and that's critical right now.</p><h3 id=\"offer-multiple-payment-options\">Offer multiple payment options</h3><p>One final objection can still bite you here - payment options. &nbsp;A lot of people are happy to throw up a <a href=\"https://stripe.com/en-ca/\">Stripe</a> form and call it a day, and to a large degree, that works. &nbsp;Stripe's a great company with a simple API that makes it easy to accept and manage credit card subscriptions. But if you stop there, you are likely throwing away money.</p><p><a href=\"https://www.paypal.com/ca/home\">PayPal</a> is a <strong>big name</strong> when it comes to online purchases, to the point that in some cases, <a href=\"https://greaterdanorequalto.com/paypal-vs-stripe/\">up to two-thirds of purchases for certain products are made through PayPal</a>. Stripe may be easier (<strong>much</strong> easier, believe me, I get it) to set up, but PayPal can be easier for users to use, with a simple email/password flow instead of having to dig up and fill out credit card details. &nbsp;Plus, users can manage their subscriptions from PayPal itself, giving them greater and simpler control of their finances.</p><p>Yes, it's more work for you to set up and maintain alternate payment flows, but this is one of those rare occasions where coding work is almost guaranteed to turn into extra revenue, and it's trackable, too! &nbsp;A new feature may or may not increase trial conversions - it's hard to tell. &nbsp;But it's very easy to tell what percentage of your revenue comes from PayPal versus other sources. &nbsp;While it can be tricky to identify how much of that is growth versus simple preference, you can directly see the percentage of people that you made life (and this purchase) distinctly easier for.</p><p>Oh, absolutely! &nbsp;Don't ever not spend time on, wait, I mean, always don't never won't spend... &nbsp;You shouldn't... &nbsp;Okay. &nbsp;Look. &nbsp;It's not that complicated.</p><p>Just make sure you're listening to what your customers are telling you. &nbsp;Make sure you understand what they want and that you're fulfilling that need. &nbsp;Make sure your first-run experience is simple and clear. &nbsp;Make sure you're offering to help. &nbsp;Make sure your service is valued and a priority in your customer's mind. &nbsp;Make sure it's easy for customers to spend money at you.</p><p>And really, all that? &nbsp;That's user onboarding. &nbsp;It's just not what people normally think of as \"user onboarding\". &nbsp;They think about tooltips, and guided tours, and progress bars, and gamification. &nbsp;But before you get there, you want to make sure you have a killer product that people are eager to try and then buy. &nbsp;You want to do everything you can to get yourself out of their way, offer help when they need it, and make sure they experience value as soon as possible. &nbsp;Make yourself easy to love.</p><p>Then add the tooltips.</p><span>\n                </span></div>"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"dont-waste-time-on-user-onboarding"}}